

class PowerObject {
  final String parent;
  final String value;
  final bool hasChild;
  final String bigParent;

  PowerObject({
    required this.parent,
    required this.value,
    this.hasChild = true,
    this.bigParent = '',
  });
}

class PowerDatas {
  static List<PowerObject> layer1 = [
    PowerObject(
      parent: 'منو',
      value: 'سیم و کابل مورد نیاز  ساختمان',
    ),
    PowerObject(
      parent: 'منو',
      value: 'جریان مصرفی وسایل خانگی',
    ),
  ];
  static List<PowerObject> layer2 = [
    PowerObject(
        parent: 'سیم و کابل مورد نیاز  ساختمان',
        value: 'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق'),
    PowerObject(
      parent: 'سیم و کابل مورد نیاز  ساختمان',
      value:
          'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    ),
    PowerObject(
      parent: 'جریان مصرفی وسایل خانگی',
      value: 'سرمایشی',
    ),
    PowerObject(
      parent: 'جریان مصرفی وسایل خانگی',
      value: 'گرمایشی',
    ),
    PowerObject(
      parent: 'جریان مصرفی وسایل خانگی',
      value: 'آشپزخانه',
    ),
    PowerObject(
      parent: 'جریان مصرفی وسایل خانگی',
      value: 'روشنایی',
    ),
    PowerObject(
      parent: 'جریان مصرفی وسایل خانگی',
      value: 'آسانسور',
    ),
  ];
  static List<PowerObject> layer3 = [
    PowerObject(
      parent: 'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
      value: """سیم ۱٫۵ قرمز:   ۱۰۰ متر   – روشنایی – ارتباطی
سیم ۱٫۵ قهوه ای:  ۱۵۰ متر    – روشنایی – برگشتی
سیم یک و نیم آبی:   ۱۷۰متر  – روشنایی
سیم یک و نیم زرد:  ۱۷۰متر   – روشنایی
سیم یک و نیم  در سه رنگ مختلف غیر از رنگ زرد –  هر کدام  ۶۰ متر   –  اعلام حریق
سیم ۲٫۵ قرمز :   ۱۵۰ متر  – پریز ها
سیم ۲٫۵ آبی: ۱۵۰  متر   – پریز ها
سیم ۲٫۵ زرد: ۱۵۰  متر  – پریز ها
کابل تلفن دو زوج  :  ۶۰ متر (فقط داخل واحد محاسبه شده)
کابل آنتن :  ۵۰ متر (فقط داخل واحد محاسبه شده)
کابل آیفن : ۶ متر  (فقط داخل واحد محاسبه شده)
کابل کولر  آبی :  ۱۰ متر  (فقط داخل واحد محاسبه شده)
""",
      hasChild: false,
    ),
    // PowerObject(
    //   parent: 'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    //   value: 'سیم 1.5 قهوه ای',
    // ),
    // PowerObject(
    //   parent: 'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    //   value: 'سیم 1.5 آبی',
    // ),
    // PowerObject(
    //   parent: 'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    //   value: 'سیم 1.5 زرد',
    // ),
    // PowerObject(
    //   parent: 'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    //   value: 'سیم یک و نیم  در سه رنگ مختلف غیر از رنگ زرد',
    // ),
    // PowerObject(
    //   parent: 'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    //   value: 'سیم 2.5 قرمز',
    // ),
    // PowerObject(
    //   parent: 'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    //   value: 'سیم 2.5 آبی',
    // ),
    // PowerObject(
    //   parent: 'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    //   value: 'سیم 2.5 زرد',
    // ),
    // PowerObject(
    //   parent: 'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    //   value: 'کابل تلفن دو زوج',
    // ),
    // PowerObject(
    //   parent: 'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    //   value: 'کابل آنتن',
    // ),
    // PowerObject(
    //   parent: 'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    //   value: 'کابل آیفن',
    // ),
    // PowerObject(
    //   parent: 'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    //   value: 'کابل کولر آبی',
    // ),
    PowerObject(
      parent:
          'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
      value: """سیم یک و نیم قرمز:   ۱۴  کلاف
سیم یک و نیم قهوه ای:  ۹ کلاف
سیم یک و نیم آبی:   ۱۳  کلاف
سیم یک و نیم زرد:  ۱۳  کلاف
سیم دو نیم قرمز :   ۱۴کلاف
سیم دو نیم آبی:  ۱۴  کلاف
سیم دو نیم زرد:  ۱۴  کلاف
کابل تلفن دو زوج  :  ۴ کلاف  (۲۵۰ متری)
کابل آنتن :  ۸ کلاف (۱۰۰ متری)
کابل آیفن :   ۳۵۰  متر
کابل  ۴ زوج کابل کولر  آبی :  ۲۰۰  متر
کابل   ۱٫۵*۵   /  بستگی به نوع طراحی دارد که کولر داخل واحد باشد یا پشت بام کابل ۶*۳
برای برق اصلی هر واحد :    ۳۰۰ تا ۳۵۰ متر  با توجه به قرار گیری محل تابلو برق اصلی متغییر است.
""",
      hasChild: false,
    ),
    // PowerObject(
    //   parent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: 'سیم 1.5 قهوه ای',
    // ),
    // PowerObject(
    //   parent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: 'سیم 1.5 آبی',
    // ),
    // PowerObject(
    //   parent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: 'سیم 1.5 زرد',
    // ),
    // PowerObject(
    //   parent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: 'سیم 2.5 قرمز',
    // ),
    // PowerObject(
    //   parent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: 'سیم 2.5 آبی',
    // ),
    // PowerObject(
    //   parent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: 'سیم 2.5 زرد',
    // ),
    // PowerObject(
    //   parent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: 'کابل تلفن دو زوج',
    // ),
    // PowerObject(
    //   parent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: 'کابل آنتن',
    // ),
    // PowerObject(
    //   parent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: 'کابل آیفن',
    // ),
    // PowerObject(
    //   parent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: 'کابل 4 زوج کولر آبی',
    // ),
    // PowerObject(
    //   parent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: 'کابل 1.5*5',
    // ),
    // PowerObject(
    //   parent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: 'برای برق اصلی هر واحد ',
    // ),
    PowerObject(
      parent: 'سرمایشی',
      value: 'کولرگازی',
    ),
    PowerObject(
      parent: 'سرمایشی',
      value: 'کولرآبی',
    ),
    PowerObject(
      parent: 'سرمایشی',
      value: 'پنکه',
    ),
    PowerObject(
      parent: 'گرمایشی',
      value: 'بخاری برقی',
    ),
    PowerObject(
      parent: 'گرمایشی',
      value: 'شوفاژ برقی',
    ),
    PowerObject(
      parent: 'آشپزخانه',
      value: 'یخچال',
    ),
    PowerObject(
      parent: 'آشپزخانه',
      value: 'ماشین لباسشویی',
    ),
    PowerObject(
      parent: 'آشپزخانه',
      value: 'ماشین ظرف شویی',
    ),
    PowerObject(
      parent: 'روشنایی',
      value: 'ال ای دی',
    ),
    PowerObject(
      parent: 'روشنایی',
      value: 'فلورسنت',
    ),
    PowerObject(
      parent: 'روشنایی',
      value: 'کم مصرف',
    ),
    PowerObject(
      parent: 'روشنایی',
      value: 'رشته ای',
    ),
    PowerObject(
      parent: 'آسانسور',
      value: 'ظرفیت 4 نفره',
    ),
    PowerObject(
      parent: 'آسانسور',
      value: 'ظرفیت 6 نفره',
    ),
    PowerObject(
      parent: 'آسانسور',
      value: 'ظرفیت 8 نفره',
    ),
    PowerObject(
      parent: 'آسانسور',
      value: 'ظرفیت 10 نفره',
    ),
    PowerObject(
      parent: 'آسانسور',
      value: 'ظرفیت 13 نفره',
    ),
    PowerObject(
      parent: 'آسانسور',
      value: 'ظرفیت 19 نفره',
    ),
  ];

  static List<PowerObject> layer4 = [
    // PowerObject(
    //   parent: 'سیم 1.5 قرمز',
    //   value: '۱۰۰ متر   – روشنایی – ارتباطی',
    //   bigParent:
    //       'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    // ),
    // PowerObject(
    //   parent: 'سیم 1.5 قهوه ای',
    //   value: '۱۵۰ متر    – روشنایی – برگشتی',
    //   bigParent:
    //       'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    // ),
    // PowerObject(
    //   parent: 'سیم 1.5 آبی',
    //   value: '۱۷۰متر  – روشنایی',
    //   bigParent:
    //       'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    // ),
    // PowerObject(
    //   parent: 'سیم 1.5 زرد',
    //   value: '۱۷۰متر   – روشنایی',
    //   bigParent:
    //       'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    // ),
    // PowerObject(
    //   parent: 'سیم یک و نیم  در سه رنگ مختلف غیر از رنگ زرد',
    //   value: 'هر کدام  ۶۰ متر   –  اعلام حریق',
    //   bigParent:
    //       'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    // ),
    // PowerObject(
    //   parent: 'سیم 2.5 قرمز',
    //   value: '۱۵۰ متر  – پریز ها',
    //   bigParent:
    //       'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    // ),
    // PowerObject(
    //   parent: 'سیم 2.5 آبی',
    //   value: '۱۵۰  متر   – پریز ها',
    //   bigParent:
    //       'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    // ),
    // PowerObject(
    //   parent: 'سیم 2.5 زرد',
    //   value: '۱۵۰  متر  – پریز ها',
    //   bigParent:
    //       'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    // ),
    // PowerObject(
    //   parent: 'کابل تلفن دو زوج',
    //   value: '۶۰ متر ',
    //   bigParent:
    //       'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    // ),
    // PowerObject(
    //   parent: 'کابل آنتن',
    //   value: '۵۰ متر',
    //   bigParent:
    //       'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    // ),
    // PowerObject(
    //   parent: 'کابل آیفن',
    //   value: '۶ متر ',
    //   bigParent:
    //       'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    // ),
    // PowerObject(
    //   parent: 'کابل کولر آبی',
    //   value: '۱۰ متر ',
    //   bigParent:
    //       'متراژ تقریبی برای یک واحد 100 تا 120 متری به همراه اعلام حریق',
    // ),
    // PowerObject(
    //   parent: 'سیم 1.5 قرمز',
    //   value: '14 کلاف',
    //   bigParent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    // ),
    // PowerObject(
    //   parent: 'سیم 1.5 قهوه ای',
    //   bigParent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: '9 کلاف',
    // ),
    // PowerObject(
    //   parent: 'سیم 1.5 آبی',
    //   bigParent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: '13 کلاف',
    // ),
    // PowerObject(
    //   parent: 'سیم 1.5 زرد',
    //   bigParent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: '13 کلاف',
    // ),
    // PowerObject(
    //   parent: 'سیم 2.5 قرمز',
    //   bigParent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: '14 کلاف',
    // ),
    // PowerObject(
    //   parent: 'سیم 2.5 آبی',
    //   bigParent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: '14 کلاف',
    // ),
    // PowerObject(
    //   parent: 'سیم 2.5 زرد',
    //   bigParent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: '14 کلاف',
    // ),
    // PowerObject(
    //   parent: 'کابل تلفن دو زوج',
    //   bigParent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: '4 کلاف',
    // ),
    // PowerObject(
    //   parent: 'کابل آنتن',
    //   bigParent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: '8 کلاف',
    // ),
    // PowerObject(
    //   parent: 'کابل آیفن',
    //   bigParent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: '350 متر',
    // ),
    // PowerObject(
    //   parent: 'کابل 4 زوج کولر آبی',
    //   bigParent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value: '200 متر',
    // ),
    // PowerObject(
    //   parent: 'کابل 1.5*5',
    //   bigParent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value:
    //       'بستگی به نوع طراحی دارد که کولر داخل واحد باشد یا پشت بام کابل3 * 6',
    // ),
    // PowerObject(
    //   parent: 'برای برق اصلی هر واحد ',
    //   bigParent:
    //       'متراژ تقریبی کل سیم مورد نیاز یک واحد آپارتمان ۱۰ واحده  ۱۵۰ متر زیر بنا همراه با پارکینگ – پشت بام – راه پله – انباری ها – حیاط – نور پردازی نما و…',
    //   value:
    //       '300 تا 350 متر  با توجه به قرار گیری محل تابلو برق اصلی متغییر است',
    // ),
    PowerObject(
      parent: 'کولرگازی',
      value: 'کولر 8000',
    ),
    PowerObject(
      parent: 'کولرگازی',
      value: 'کولر 12000',
    ),
    PowerObject(
      parent: 'کولرگازی',
      value: 'کولر 18000',
    ),
    PowerObject(
      parent: 'کولرگازی',
      value: 'کولر 24000',
    ),
    PowerObject(
      parent: 'کولرگازی',
      value: 'کولر 30000',
    ),
    PowerObject(
      parent: 'کولرآبی',
      value: 'کولر 3500',
    ),
    PowerObject(
      parent: 'کولرآبی',
      value: 'کولر 7000',
    ),
    PowerObject(
      parent: 'کولرآبی',
      value: 'کولر 7500',
    ),
    PowerObject(
      parent: 'کولرآبی',
      value: 'کولر 15000',
    ),
    PowerObject(
      parent: 'کولرآبی',
      value: 'کولر 18000',
    ),
    PowerObject(
      parent: 'کولرآبی',
      value: 'کولر 18000 اینورتر',
    ),
    PowerObject(
      parent: 'پنکه',
      value: 'دستی',
    ),
    PowerObject(
      parent: 'پنکه',
      value: 'سقفی',
    ),
    PowerObject(
      parent: 'بخاری برقی',
      value: """500 تا 2000 وات 
2 تا 10 امپر""",
      bigParent: 'گرمایشی',
    ),
    PowerObject(
      parent: 'شوفاژ برقی',
      value: """200 تا 3000 وات
1 تا 14 امپر""",
      bigParent: 'گرمایشی',
    ),
    PowerObject(
      parent: 'یخچال',
      value: '12 فوت',
    ),
    PowerObject(
      parent: 'یخچال',
      value: '16 فوت',
    ),
    PowerObject(
      parent: 'یخچال',
      value: '20 فوت',
    ),
    PowerObject(
      parent: 'ماشین لباسشویی',
      value: 'سطلی',
    ),
    PowerObject(
      parent: 'ماشین لباسشویی',
      value: 'نیمه اتوماتیک',
    ),
    PowerObject(
      parent: 'ماشین لباسشویی',
      value: 'تمام اتوماتیک',
    ),
    PowerObject(
      parent: 'ماشین ظرف شویی',
      value: """1000 تا 3000 وات
5 تا 13.5 امپر""",
      bigParent: 'آشپزخانه',
    ),
    PowerObject(
      parent: 'ال ای دی',
      value: """هر 100 وات 
3000 تا 9000 لومن
نیم امپر""",
      bigParent: 'روشنایی',
    ),
    PowerObject(
      parent: 'فلورسنت',
      value: """هر 100 وات 
3500 تا 6500 لومن
نیم امپر""",
      bigParent: 'روشنایی',
    ),
    PowerObject(
      parent: 'کم مصرف',
      value: """هر 100 وات 
4500 تا 7500 لومن
نیم امپر""",
      bigParent: 'روشنایی',
    ),
    PowerObject(
      parent: 'رشته ای',
      value: """هر 100 وات 
1250 تا 1750 لومن
نیم امپر""",
      bigParent: 'روشنایی',
    ),
    PowerObject(
        parent: 'ظرفیت 4 نفره',
        value: """4 کیلووات
5 تا 8 امپر""",
        bigParent: 'آسانسور'),
    PowerObject(
        parent: 'ظرفیت 6 نفره',
        value: """5.5 کیلووات
5 تا 13 امپر""",
        bigParent: 'آسانسور'),
    PowerObject(
        parent: 'ظرفیت 8 نفره',
        value: """7.5 کیلووات
5 تا 18 امپر""",
        bigParent: 'آسانسور'),
    PowerObject(
        parent: 'ظرفیت 10 نفره',
        value: """9.5 کیلووات 
20 امپر""",
        bigParent: 'آسانسور'),
    PowerObject(
        parent: 'ظرفیت 13 نفره',
        value: """12.5 کیلووات 
25 امپر""",
        bigParent: 'آسانسور'),
    PowerObject(
        parent: 'ظرفیت 19 نفره',
        value: """18.5 کیلووات 
35 امپر""",
        bigParent: 'آسانسور'),
  ];

  static List<PowerObject> layer5 = [
    PowerObject(
      parent: 'کولر 8000',
      value: '4 امپر',
      hasChild: false,
    ),
    PowerObject(
      parent: 'کولر 12000',
      value: '6 امپر',
      hasChild: false,
    ),
    PowerObject(
      parent: 'کولر 18000',
      value: '9 امپر',
      hasChild: false,
      bigParent: 'کولرگازی',
    ),
    PowerObject(
      parent: 'کولر 24000',
      value: '12 امپر',
      hasChild: false,
    ),
    PowerObject(
      parent: 'کولر 30000',
      value: '15 امپر',
      hasChild: false,
    ),
    PowerObject(
      parent: 'کولر 3500',
      value: '2 امپر',
      hasChild: false,
    ),
    PowerObject(
      parent: 'کولر 7000',
      value: '3 امپر',
      hasChild: false,
    ),
    PowerObject(
      parent: 'کولر 7500',
      value: '3 امپر',
      hasChild: false,
    ),
    PowerObject(
      parent: 'کولر 15000',
      value: '7 امپر',
      hasChild: false,
    ),
    PowerObject(
      parent: 'کولر 18000',
      value: '18 امپر',
      hasChild: false,
      bigParent: 'کولرآبی',
    ),
    PowerObject(
      parent: 'کولر 18000 اینورتر',
      value: '5.5 امپر',
      hasChild: false,
    ),
    PowerObject(
      parent: 'دستی',
      value: '0.2 امپر',
      hasChild: false,
    ),
    PowerObject(
      parent: 'سقفی',
      value: '0.5 امپر',
      hasChild: false,
    ),
    PowerObject(
      parent: '12 فوت',
      value: """280 وات
1 امپر""",
      hasChild: false,
    ),
    PowerObject(
      parent: '16 فوت',
      value: """350 وات
1.6 امپر""",
      hasChild: false,
    ),
    PowerObject(
      parent: '20 فوت',
      value: """420 وات
2 امپر""",
      hasChild: false,
    ),
    PowerObject(
      parent: 'سطلی',
      value: """300 تا 600 وات
1 تا 3 امپر""",
      hasChild: false,
    ),
    PowerObject(
      parent: 'نیمه اتوماتیک',
      value: """300 - 1200 وات
1 تا 6 امپر""",
      hasChild: false,
    ),
    PowerObject(
      parent: 'تمام اتوماتیک',
      value: """500 - 3500 وات
2.2 تا 16 امپر""",
      hasChild: false,
    ),
  ];
}
