class TelecomDatas {
  static Map<String, String> types = {
    'A': 'مصارف بیرون ساختمان',
    'AB': 'کابل بیرون ساختمان به همراه حفاظت ازصاعقه',
    'AJ': 'کابل بیرون ساختمان به همراه حفاظت ازالقای مغناطیس',
    'G': 'کابل معدن',
    'J': 'کابل نصب داخلی',
    'JE': 'کابل نصب داخلی برای صنایع الکترونیک',
    'JE-H': 'کابل نصب داخلی برای صنایع الکترونیک هالوژن فری',
    'S': 'کابل های سوییچ',
    'T': 'کابل های  توزیع',
    'YV/Li...': 'سیم های رانژه / گوشی تلفن',
  };
  static Map<String, String> insulation = {
    'P': 'کاغذ خشک',
    'Y': 'پی وی سی',
    '2Y': 'پلی اتیلن',
    'Q2Y': 'پلی اتیلن فوم',
    'Q2YS': 'پلی اتیلن فوم با پوسته جامد',
    '3Y': 'استایروفلکس',
    '5Y': 'تفلون',
    '6Y': 'فلورونیتد اتیلن پروپیلن',
    '7Y': 'اتیلن تترافلورواتیلن',
  };
  static Map<String, String> shield = {
    'C': 'شیلد شده با بافت مسی',
    'D': 'شیلد شده با اسپیرال مسی',
    'F': 'کابل با ژله نفتی پر شده است',
    '(K)': 'شیلد شده با نوار مسی با بستر پلی اتیلن ',
    '(L)': 'نوار الومینیوم',
    '(ms)': 'شیلد شده با نوار فولادی  مغناطیسی',
    '(St)': 'شیلد شده با الومینیوم پوشش داده  شده روی  نوار پلاستیکی',
    '(Z)': 'بافت فولادی با تنسایل بالا',
  };
  static Map<String, String> armor = {
    'L': 'غلاف الومینیومی صاف',
    '(L)2Y': 'غلاف الومینیومی پوشش داده شده با پلیمر ، مانع ورود اب',
    'LD': 'غلاف الومینیومی کرکره ای شده ',
    'M': 'غلاف سربی',
    'Mz': 'غلاف الیاژ سربی',
    'W': 'غلاف ورق فولادی کرکره ای شده',
    ' ': 'بدون حفاظ',
  };
  static Map<String, String> jacket = {
    'Y': 'روکش پی وی  سی',
    'Yv': 'روکش پی وی سی تقویت شده ',
    'Yw': 'روکش پی وی سی مقاوم در مقابل حرارت',
    'Yu': 'پی وی سی مقاوم در مقابل  شعله',
    '2Y': 'روکش پلی اتیلن',
    '2YV': 'روکش پلی اتیلن تقویت شده',
    'E': 'ترکیب با نوار پلاستیکی تعبیه شده',
    'C': 'روکش شده با کنف و کامپوند',
  };
  static Map<String, String> number = {
    '2': '2',
    '4': '4',
    '6': '6',
    '8': '8',
    '10': '10',
    '15': '15',
    '20': '20',
    '25': '25',
    '30': '30',
    '40': '40',
    '50': '50',
    '70': '70',
    '100': '100',
  };
  static Map<String, String> arrange = {
    '2': '2',
    '3': '3',
    '4': '4',
    '5': '5',
  };
  static Map<String, String> size = {
    '0.4': '0.4',
    '0.5': '0.5',
    '0.6': '0.6',
    '0.7': '0.7',
  };
}
